## Plan Result (pocket-event-bridge-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/242895)



<pre><code>Plan: 7 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_cloudwatch_event_rule.search-api-events_PocketEventBridge-Prod-SearchApi-EventBridge-Rule_event-bridge-rule_BED5FF67
  * aws_cloudwatch_event_target.search-api-events_PocketEventBridge-Prod-SearchApi-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-SearchApi-Event-SNS-Target_D4C84C6A
  * aws_cloudwatch_metric_alarm.search-api-events_searchapievents-rule-dlq-alarm_6C7B6DB6
  * aws_sns_topic.search-api-events_search-api-event-topic_9202A150
  * aws_sns_topic_policy.search-api-events_searchapi-events-sns-topic-policy_9270FFC6
  * aws_sqs_queue.search-api-events_sns-topic-dql_653D177A
  * null_resource.search-api-events_null-resource_43620CE7



<details><summary>Change Result (Click me)</summary>

```hcl

  # data.aws_iam_policy_document.search-api-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_AF4B1F50 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "search-api-events_PocketEventBridge-Prod-EventBridge-SNS-Policy_AF4B1F50" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_cloudwatch_event_rule.search-api-events_PocketEventBridge-Prod-SearchApi-EventBridge-Rule_event-bridge-rule_BED5FF67 will be created
  + resource "aws_cloudwatch_event_rule" "search-api-events_PocketEventBridge-Prod-SearchApi-EventBridge-Rule_event-bridge-rule_BED5FF67" {
      + arn            = (known after apply)
      + event_bus_name = "PocketEventBridge-Prod-Shared-Event-Bus"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "corpus_search_result",
                ]
              + source      = [
                  + "search-api-events",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "PocketEventBridge-Prod-SearchApiEvents-Rule-Rule"
      + name_prefix    = (known after apply)
      + tags_all       = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
    }

  # aws_cloudwatch_event_target.search-api-events_PocketEventBridge-Prod-SearchApi-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-SearchApi-Event-SNS-Target_D4C84C6A will be created
  + resource "aws_cloudwatch_event_target" "search-api-events_PocketEventBridge-Prod-SearchApi-EventBridge-Rule_event-bridge-rule_event-bridge-target-PocketEventBridge-Prod-SearchApi-Event-SNS-Target_D4C84C6A" {
      + arn            = (known after apply)
      + event_bus_name = "PocketEventBridge-Prod-Shared-Event-Bus"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "PocketEventBridge-Prod-SearchApiEvents-Rule-Rule"
      + target_id      = "PocketEventBridge-Prod-SearchApi-Event-SNS-Target"

      + dead_letter_config {
          + arn = (known after apply)
        }
    }

  # aws_cloudwatch_metric_alarm.search-api-events_searchapievents-rule-dlq-alarm_6C7B6DB6 will be created
  + resource "aws_cloudwatch_metric_alarm" "search-api-events_searchapievents-rule-dlq-alarm_6C7B6DB6" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:996905175585:Backend-Prod-ChatBot",
        ]
      + alarm_description                     = "Number of messages >= 10"
      + alarm_name                            = "PocketEventBridge-Prod-SearchApiEvents-Rule-dlq-alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "QueueName" = "PocketEventBridge-Prod-SNS-SearchApiEvents-Topic-DLQ"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 4
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfMessagesVisible"
      + namespace                             = "AWS/SQS"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:996905175585:Backend-Prod-ChatBot",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags_all                              = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + threshold                             = 10
      + treat_missing_data                    = "missing"
    }

  # aws_sns_topic.search-api-events_search-api-event-topic_9202A150 will be created
  + resource "aws_sns_topic" "search-api-events_search-api-event-topic_9202A150" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "PocketEventBridge-Prod-SearchApiEventTopic"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_policy.search-api-events_searchapi-events-sns-topic-policy_9270FFC6 will be created
  + resource "aws_sns_topic_policy" "search-api-events_searchapi-events-sns-topic-policy_9270FFC6" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = (known after apply)
    }

  # aws_sqs_queue.search-api-events_sns-topic-dql_653D177A will be created
  + resource "aws_sqs_queue" "search-api-events_sns-topic-dql_653D177A" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "PocketEventBridge-Prod-SNS-SearchApiEvents-Topic-DLQ"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + tags_all                          = {
          + "app_code"       = "pocket-content-shared"
          + "component_code" = "pocket-content-shared-pocketeventbridge"
          + "costCenter"     = "Shared"
          + "env_code"       = "prod"
          + "environment"    = "Prod"
          + "owner"          = "Pocket"
          + "service"        = "PocketEventBridge"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # null_resource.search-api-events_null-resource_43620CE7 will be created
  + resource "null_resource" "search-api-events_null-resource_43620CE7" {
      + id = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"0e439e1c-0a0c-4c43-8b99-7b277269065a","JobName":"pocket-event-bridge_infrastructure_plan_prod","PRNumber":666,"Program":"tfcmt","SHA1":"60c7b814c55974c931e738c0538db4205aa11207","Target":"pocket-event-bridge-cdk","Vars":{}} -->